//  显示从100到1000之间所有既能被5整除，也能被6整除的数字，要求每行显示10个数字

// 行字符串
var rowStr = '';
// 统计一下这个行现在有几个数字了
// 这个变量不能放到for循环里面，要不然每遍历一个数字，就清零0
var count = 0;

// 遍历数字
for (var i = 100; i <= 1000; i++) {
    // 寻找是否符合条件
    if (i % 5 == 0 && i % 6 == 0) {
        // 你找到的这个数字肯定拼接字符串，先不要先输出的事情
        rowStr += i + ' ';
        // 计数器加1
        count++;

        // 什么时候要输出，满10个就输出
        if (count == 10) {
            // 输出
            console.log(rowStr);
            // 计数器要清零，下一行开始了
            count = 0;
            // 行字符串也要清零
            rowStr = '';
        }
    }
}
